-- Q1 #新しいテーブルを追加
CREATE TABLE departments (
department_id INT unsigned NOT NULL auto_increment PRIMARY KEY,
name VARCHAR(20) NOT NULL,
created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
updated_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
);
-- DESC departments;


-- Q2 #新しいカラムを追加
ALTER TABLE people ADD department_id INT unsigned AFTER email;
-- DESC people;


-- Q3-1 #追加する部署
insert into departments (name) 
values 
('営業'),
('開発'),
('経理'),
('人事'),
('情報システム');
-- DESC departments;

-- Q3-2 #追加する人
-- ↓person_idをあと5件追加する（名前などを自作する？）ということでいいのか確認する → 新しく10人追加(peopleテーブルにいない人)
insert into people (name, email, age, gender) 
VALUES 
('桜井はる美', 'sakurai@gizumo.jp', 42, 2),
('冬川椿', 'huyukawa@gizumo.jp', 33, 1),
('山村椛', 'yamamura@gizumo.jp', 28, 2),
('日向あおい', 'himukai@gizumo.jp', 30, 2),
('菊池としお', 'kikuchi@gizumo.jp', 45, 1),
('白井ゆりこ', 'shirai@gizumo.jp', 54, 2),
('小金井あき穂', 'koganei@gizumo.jp', 36, 2),
('潮田かいと', 'ushioda@gizumo.jp', 23, 1),
('藤原すみれ', 'fujiwara@gizumo.jp', 27, 2),
('星名こうじ', 'hoshina@gizumo.jp', 49, 1);
-- SELECT * FROM people;
-- | person_id | name           | email               | department_id | age  | gender | created_at          | updated_at          |
-- +-----------+----------------+---------------------+---------------+------+--------+---------------------+---------------------+
-- |         1 | 鈴木たかし     | suzuki@gizumo.jp    |             1 |   20 |      1 | 2024-08-28 12:38:05 | 2024-09-01 12:39:47 |
-- |         2 | 田中ゆうこ     | tanaka@gizumo.jp    |             1 |   25 |      2 | 2024-08-28 12:40:14 | 2024-09-01 12:50:41 |
-- |         3 | 福田だいすけ   | fukuda@gizumo.jp    |          NULL |   42 |      1 | 2024-08-28 12:40:14 | 2024-08-28 12:40:14 |
-- |         4 | 豊島はなこ     | toyoshima@gizumo.jp |          NULL |   34 |      2 | 2024-08-28 12:40:14 | 2024-08-28 12:40:14 |
-- |         6 | 不思議沢みちこ | NULL                |          NULL | NULL |   NULL | 2024-08-28 12:40:14 | 2024-08-28 12:40:14 |
-- |         9 | 桜井はる美     | sakurai@gizumo.jp   |          NULL |   42 |      2 | 2024-09-02 21:00:55 | 2024-09-02 21:00:55 |
-- |        10 | 冬川椿         | huyukawa@gizumo.jp  |          NULL |   33 |      1 | 2024-09-02 21:00:55 | 2024-09-02 21:00:55 |
-- |        11 | 山村椛         | yamamura@gizumo.jp  |          NULL |   28 |      2 | 2024-09-02 21:00:55 | 2024-09-02 21:00:55 |
-- |        12 | 日向あおい     | himukai@gizumo.jp   |          NULL |   30 |      2 | 2024-09-02 21:00:55 | 2024-09-02 21:00:55 |
-- |        13 | 菊池としお     | kikuchi@gizumo.jp   |          NULL |   45 |      1 | 2024-09-02 21:00:55 | 2024-09-02 21:00:55 |
-- |        14 | 白井ゆりこ     | shirai@gizumo.jp    |          NULL |   54 |      2 | 2024-09-02 21:12:47 | 2024-09-02 21:12:47 |
-- |        15 | 小金井あき穂   | koganei@gizumo.jp   |          NULL |   36 |      2 | 2024-09-02 21:12:47 | 2024-09-02 21:12:47 |
-- |        16 | 潮田かいと     | ushioda@gizumo.jp   |          NULL |   23 |      1 | 2024-09-02 21:12:47 | 2024-09-02 21:12:47 |
-- |        17 | 藤原すみれ     | fujiwara@gizumo.jp  |          NULL |   27 |      2 | 2024-09-02 21:12:47 | 2024-09-02 21:12:47 |
-- |        18 | 星名こうじ     | hoshina@gizumo.jp   |          NULL |   49 |      1 | 2024-09-02 21:12:47 | 2024-09-02 21:12:47 |
-- +-----------+----------------+---------------------+---------------+------+--------+---------------------+---------------------+

-- Q3-3 #追加する日報
-- 10件あるけど『日報の文字数は最低10文字で、同じ日報を作成しない』ができていない  →  削除はしなくていい。
-- 今回追加する10件が『日報は誰に紐付けてもいいが、存在しないperson_idとは紐付けない=person_id "5,7,8"は使わない』と
-- 『日報の文字数は最低10文字で、同じ日報を作成しない』を満たせばOK。
insert into reports (person_id, content ) 
values
(1, '本社に出勤して営業会議を進行した' ),
(2, '本社に出勤して営業会議に参加した' ),
(3, '在宅勤務にてリモートで営業会議に参加した' ),
(4, '本社に出勤してクライアントと商談した' ),
(9, '本社に出勤して開発会議の議事録を作成した' ),
(10, '在宅勤務にて開発業務を遂行した' ),
(11, '本社に出勤して経理業務を行った' ),
(12, '在宅勤務にてクライアントの問い合わせ対応を行った' ),
(13, 'サービス開始のため支店へ出張' ),
(14, '本社に出勤して来客対応を行った' );
-- SELECT * FROM reports;
-- +-----------+-----------+--------------------------------------------------+---------------------+---------------------+
-- | report_id | person_id | content                                          | created_at          | updated_at          |
-- +-----------+-----------+--------------------------------------------------+---------------------+---------------------+
-- |         1 |         1 | office                                           | 2024-08-29 22:34:51 | 2024-08-29 22:34:51 |
-- |         2 |         2 | office                                           | 2024-08-29 22:45:07 | 2024-08-29 22:45:07 |
-- |         3 |         2 | office                                           | 2024-08-29 22:45:26 | 2024-08-29 22:45:26 |
-- |         4 |         1 | remote                                           | 2024-08-29 22:46:10 | 2024-08-29 22:46:10 |
-- |         5 |         3 | office                                           | 2024-08-29 22:46:40 | 2024-08-29 22:46:40 |
-- |         7 |         3 | remote                                           | 2024-08-29 22:47:11 | 2024-08-29 22:47:11 |
-- |         8 |         6 | remote                                           | 2024-08-29 22:47:33 | 2024-08-29 22:47:33 |
-- |         9 |         2 | remote                                           | 2024-08-29 22:47:47 | 2024-08-29 22:47:47 |
-- |        10 |         6 | office                                           | 2024-08-29 22:48:31 | 2024-08-29 22:48:31 |
-- |        11 |         1 | office                                           | 2024-09-01 13:11:47 | 2024-09-01 13:11:47 |
-- |        12 |         1 | 本社に出勤して営業会議を進行した                 | 2024-09-02 21:23:26 | 2024-09-02 21:23:26 |
-- |        13 |         2 | 本社に出勤して営業会議に参加した                 | 2024-09-02 21:23:26 | 2024-09-02 21:23:26 |
-- |        14 |         3 | 在宅勤務にてリモートで営業会議に参加した         | 2024-09-02 21:23:26 | 2024-09-02 21:23:26 |
-- |        15 |         4 | 本社に出勤してクライアントと商談した             | 2024-09-02 21:32:41 | 2024-09-02 21:32:41 |
-- |        16 |         9 | 本社に出勤して開発会議の議事録を作成した         | 2024-09-02 21:32:41 | 2024-09-02 21:32:41 |
-- |        17 |        10 | 在宅勤務にて開発業務を遂行した                   | 2024-09-02 21:32:41 | 2024-09-02 21:32:41 |
-- |        18 |        11 | 本社に出勤して経理業務を行った                   | 2024-09-02 21:32:41 | 2024-09-02 21:32:41 |
-- |        19 |        12 | 在宅勤務にてクライアントの問い合わせ対応を行った | 2024-09-02 21:32:41 | 2024-09-02 21:32:41 |
-- |        20 |        13 | サービス開始のため支店へ出張                     | 2024-09-02 21:32:41 | 2024-09-02 21:32:41 |
-- |        21 |        14 | 本社に出勤して来客対応を行った                   | 2024-09-02 21:32:41 | 2024-09-02 21:32:41 |
-- +-----------+-----------+--------------------------------------------------+---------------------+---------------------+


-- Q4
UPDATE people SET department_id = '1' WHERE person_id = 1;  
UPDATE people SET department_id = '1' WHERE person_id = 2;  
UPDATE people SET department_id = '1' WHERE person_id = 3;  
UPDATE people SET department_id = '2' WHERE person_id = 4;  
UPDATE people SET department_id = '2' WHERE person_id = 9;  
UPDATE people SET department_id = '2' WHERE person_id = 10; 
UPDATE people SET department_id = '2' WHERE person_id = 13; 
UPDATE people SET department_id = '3' WHERE person_id = 11; 
UPDATE people SET department_id = '4' WHERE person_id = 14; 
UPDATE people SET department_id = '5' WHERE person_id = 16; 
UPDATE people SET department_id = '1' WHERE person_id = 6; 
UPDATE people SET department_id = '1' WHERE person_id = 12; 
UPDATE people SET department_id = '1' WHERE person_id = 15; 
UPDATE people SET department_id = '4' WHERE person_id = 17; 
UPDATE people SET department_id = '3' WHERE person_id = 18; 
-- SELECT * FROM people;
-- +-----------+----------------+---------------------+---------------+------+--------+---------------------+---------------------+
-- | person_id | name           | email               | department_id | age  | gender | created_at          | updated_at          |
-- +-----------+----------------+---------------------+---------------+------+--------+---------------------+---------------------+
-- |         1 | 鈴木たかし     | suzuki@gizumo.jp    |             1 |   20 |      1 | 2024-08-28 12:38:05 | 2024-09-01 12:39:47 |
-- |         2 | 田中ゆうこ     | tanaka@gizumo.jp    |             1 |   25 |      2 | 2024-08-28 12:40:14 | 2024-09-01 12:50:41 |
-- |         3 | 福田だいすけ   | fukuda@gizumo.jp    |             1 |   42 |      1 | 2024-08-28 12:40:14 | 2024-09-02 21:37:16 |
-- |         4 | 豊島はなこ     | toyoshima@gizumo.jp |             2 |   34 |      2 | 2024-08-28 12:40:14 | 2024-09-02 21:48:15 |
-- |         6 | 不思議沢みちこ | NULL                |             1 | NULL |   NULL | 2024-08-28 12:40:14 | 2024-09-03 18:18:41 |
-- |         9 | 桜井はる美     | sakurai@gizumo.jp   |             2 |   42 |      2 | 2024-09-02 21:00:55 | 2024-09-02 21:48:26 |
-- |        10 | 冬川椿         | huyukawa@gizumo.jp  |             2 |   33 |      1 | 2024-09-02 21:00:55 | 2024-09-02 21:48:43 |
-- |        11 | 山村椛         | yamamura@gizumo.jp  |             3 |   28 |      2 | 2024-09-02 21:00:55 | 2024-09-02 21:49:05 |
-- |        12 | 日向あおい     | himukai@gizumo.jp   |             1 |   30 |      2 | 2024-09-02 21:00:55 | 2024-09-03 18:18:52 |
-- |        13 | 菊池としお     | kikuchi@gizumo.jp   |             2 |   45 |      1 | 2024-09-02 21:00:55 | 2024-09-02 21:48:53 |
-- |        14 | 白井ゆりこ     | shirai@gizumo.jp    |             4 |   54 |      2 | 2024-09-02 21:12:47 | 2024-09-02 21:49:36 |
-- |        15 | 小金井あき穂   | koganei@gizumo.jp   |             1 |   36 |      2 | 2024-09-02 21:12:47 | 2024-09-03 18:19:05 |
-- |        16 | 潮田かいと     | ushioda@gizumo.jp   |             5 |   23 |      1 | 2024-09-02 21:12:47 | 2024-09-02 21:49:47 |
-- |        17 | 藤原すみれ     | fujiwara@gizumo.jp  |             4 |   27 |      2 | 2024-09-02 21:12:47 | 2024-09-03 18:19:18 |
-- |        18 | 星名こうじ     | hoshina@gizumo.jp   |             3 |   49 |      1 | 2024-09-02 21:12:47 | 2024-09-03 18:19:29 |
-- +-----------+----------------+---------------------+---------------+------+--------+---------------------+---------------------+


-- Q5 #年齢の降順で男性の名前と年齢
SELECT * FROM people HAVING gender="1" ORDER BY age DESC;
-- +-----------+--------------+--------------------+---------------+------+--------+---------------------+---------------------+
-- | person_id | name         | email              | department_id | age  | gender | created_at          | updated_at          |
-- +-----------+--------------+--------------------+---------------+------+--------+---------------------+---------------------+
-- |        18 | 星名こうじ   | hoshina@gizumo.jp  |          NULL |   49 |      1 | 2024-09-02 21:12:47 | 2024-09-02 21:12:47 |
-- |        13 | 菊池としお   | kikuchi@gizumo.jp  |             2 |   45 |      1 | 2024-09-02 21:00:55 | 2024-09-02 21:48:53 |
-- |         3 | 福田だいすけ | fukuda@gizumo.jp   |             1 |   42 |      1 | 2024-08-28 12:40:14 | 2024-09-02 21:37:16 |
-- |        10 | 冬川椿       | huyukawa@gizumo.jp |             2 |   33 |      1 | 2024-09-02 21:00:55 | 2024-09-02 21:48:43 |
-- |        16 | 潮田かいと   | ushioda@gizumo.jp  |             5 |   23 |      1 | 2024-09-02 21:12:47 | 2024-09-02 21:49:47 |
-- |         1 | 鈴木たかし   | suzuki@gizumo.jp   |             1 |   20 |      1 | 2024-08-28 12:38:05 | 2024-09-01 12:39:47 |
-- +-----------+--------------+--------------------+---------------+------+--------+---------------------+---------------------+


-- Q6 #SQL文を日本語で説明
SELECT `name`, `email`, `age`  FROM `people` WHERE `department_id` = 1 ORDER BY  `created_at`;
→『people』テーブルの『営業部』所属の人の『名前』、『e-mailアドレス』、『年齢』をレコードの作成順に取得するクエリです。




-------------------------------------------------------------------------------------------------------------------------------
-- Q7 #20代の女性と40代の男性の名前
SELECT * FROM people WHERE 20 <= age AND age <= 29 AND gender = 2 OR 40 <= age AND age <= 49 AND gender = 1;
-- +-----------+--------------+--------------------+---------------+------+--------+---------------------+---------------------+
-- | person_id | name         | email              | department_id | age  | gender | created_at          | updated_at          |
-- +-----------+--------------+--------------------+---------------+------+--------+---------------------+---------------------+
-- |         2 | 田中ゆうこ   | tanaka@gizumo.jp   |             1 |   25 |      2 | 2024-08-28 12:40:14 | 2024-09-01 12:50:41 |
-- |         3 | 福田だいすけ | fukuda@gizumo.jp   |             1 |   42 |      1 | 2024-08-28 12:40:14 | 2024-09-02 21:37:16 |
-- |        11 | 山村椛       | yamamura@gizumo.jp |             3 |   28 |      2 | 2024-09-02 21:00:55 | 2024-09-02 21:49:05 |
-- |        13 | 菊池としお   | kikuchi@gizumo.jp  |             2 |   45 |      1 | 2024-09-02 21:00:55 | 2024-09-02 21:48:53 |
-- |        17 | 藤原すみれ   | fujiwara@gizumo.jp |             4 |   27 |      2 | 2024-09-02 21:12:47 | 2024-09-03 18:19:18 |
-- |        18 | 星名こうじ   | hoshina@gizumo.jp  |             3 |   49 |      1 | 2024-09-02 21:12:47 | 2024-09-03 18:19:29 |
-- +-----------+--------------+--------------------+---------------+------+--------+---------------------+---------------------+

-- Q8 #営業部に所属する人だけ (年齢昇順)
SELECT * FROM people HAVING department_id="1"ORDER BY age ASC;
-- +-----------+----------------+-------------------+---------------+------+--------+---------------------+---------------------+
-- | person_id | name           | email             | department_id | age  | gender | created_at          | updated_at          |
-- +-----------+----------------+-------------------+---------------+------+--------+---------------------+---------------------+
-- |         6 | 不思議沢みちこ | NULL              |             1 | NULL |   NULL | 2024-08-28 12:40:14 | 2024-09-03 18:18:41 |
-- |         1 | 鈴木たかし     | suzuki@gizumo.jp  |             1 |   20 |      1 | 2024-08-28 12:38:05 | 2024-09-01 12:39:47 |
-- |         2 | 田中ゆうこ     | tanaka@gizumo.jp  |             1 |   25 |      2 | 2024-08-28 12:40:14 | 2024-09-01 12:50:41 |
-- |        12 | 日向あおい     | himukai@gizumo.jp |             1 |   30 |      2 | 2024-09-02 21:00:55 | 2024-09-03 18:18:52 |
-- |        15 | 小金井あき穂   | koganei@gizumo.jp |             1 |   36 |      2 | 2024-09-02 21:12:47 | 2024-09-03 18:19:05 |
-- |         3 | 福田だいすけ   | fukuda@gizumo.jp  |             1 |   42 |      1 | 2024-08-28 12:40:14 | 2024-09-02 21:37:16 |
-- +-----------+----------------+-------------------+---------------+------+--------+---------------------+---------------------+

-- Q9 #開発部に所属している女性の平均年齢
SELECT AVG(age) AS average_age FROM people GROUP BY gender;
-- +-------------+
-- | average_age |
-- +-------------+
-- |        NULL |
-- |     35.3333 |
-- |     34.5000 |
-- +-------------+


-- Q10 #名前、部署名、提出した日報の内容 (日報を提出していない人は含めない)




-- Q11 #日報を一つも提出していない人の名前
